#+TITLE: STL

** 遍歷
#+begin_src cpp -r -n :results output :exports both
for (vector<int>::iterator it=v.begin(); it!=v.end(); ++it)
{
    cout << *it << "\n";
}
#+end_src
#+begin_src cpp -r -n :results output :exports both
#include <vector>
#include <iostream>
using namespace std;
int main() {
    vector<int> x;
    x.push_back(3);
    x.push_back(28);
    x.push_back(9);
    x.push_back(-11);
    x.push_back(8765);
    for (vector<int>::iterator it=x.begin(); it!=x.end(); ++it) {
        cout << *it << endl;
    }
    for (int i=0; i < x.size(); i++) {
        cout << x[i] << endl;
    }
    return 0;
}
#+end_src

#+RESULTS:
#+begin_example
3
28
9
-11
8765
3
28
9
-11
8765
#+end_example

** 語法
map<K, V>
#+begin_src cpp -r -n :results output :exports both
#include <map>
#include <iostream>
using namespace std;
int main() {
    map<string, int> m;
    m["apple"] = 3;
    cout << m["apple"] << "\n";
    cout << m["banana"] << "\n"; //會變成第二個元素
    cout << m.size() << endl;
}

#+end_src

#+RESULTS:
: 3
: 0
: 2
若只是想搜尋元素而不想如上例新增，則可以用 find()
#+begin_src cpp -r -n :results output :exports both
#include <map>
#include <iostream>
using namespace std;
int main() {
    map<string, int> m;
    m["apple"] = 3;
    map<string, int>::iterator it = m.find("abc");
    if (it == m.end())
        cout << "not found\n";
    else
        cout << it->first << ":" << it->second << "\n";
    // it->first: KEY
    // it->second: VALUE
}

#+end_src
